philips-software/amp-hal-st/hal_st/stm32fxxx/DmaStm.cpp
#if defined(DMA2_Channel1) || defined(GPDMA2)
        const std::array<decltype(DmaChannelDma1), 2> DmaChannel { DmaChannelDma1, DmaChannelDma2 };
#else
        const std::array<decltype(DmaChannelDma1), 1> DmaChannel { DmaChannelDma1 };
#endif

        const std::array dmaIrqDma1
        {
#if defined(GPDMA1)
            GPDMA1_Channel0_IRQn,
            GPDMA1_Channel1_IRQn,
            GPDMA1_Channel2_IRQn,
            GPDMA1_Channel3_IRQn,
            GPDMA1_Channel4_IRQn,
            GPDMA1_Channel5_IRQn,
            GPDMA1_Channel6_IRQn,
            GPDMA1_Channel7_IRQn,
#else
            DMA1_Channel1_IRQn,
            DMA1_Channel2_IRQn,
            DMA1_Channel3_IRQn,
            DMA1_Channel4_IRQn,
            DMA1_Channel5_IRQn,
            DMA1_Channel6_IRQn,
#endif
#if defined(DMA1_Channel7)
            DMA1_Channel7_IRQn,
#endif
#if defined(DMA1_Channel8)
            DMA1_Channel8_IRQn,
#endif
        };
#if defined(DMA2_Channel1) || defined(GPDMA2)
        const std::array dmaIrqDma2
        {
#if defined(GPDMA2)
            GPDMA2_Channel0_IRQn,
            GPDMA2_Channel1_IRQn,
            GPDMA2_Channel2_IRQn,
            GPDMA2_Channel3_IRQn,
            GPDMA2_Channel4_IRQn,
            GPDMA2_Channel5_IRQn,
            GPDMA2_Channel6_IRQn,
            GPDMA2_Channel7_IRQn,
#else
            DMA2_Channel1_IRQn,
            DMA2_Channel2_IRQn,
            DMA2_Channel3_IRQn,
            DMA2_Channel4_IRQn,
            DMA2_Channel5_IRQn,
            DMA2_Channel6_IRQn,
#endif
#if defined(DMA2_Channel7)
            DMA2_Channel7_IRQn,
#endif
#if defined(DMA2_Channel8)
            DMA2_Channel8_IRQn,
#endif
        };
#endif

#if defined(DMA2_Channel1) || defined(GPDMA2)
        const std::array<decltype(dmaIrqDma1), 2> dmaIrq { dmaIrqDma1, dmaIrqDma2 };
#else
        const std::array<decltype(dmaIrqDma1), 1> dmaIrq { dmaIrqDma1 };
#endif

        const std::array streamToTCIF
        {
#ifdef DMA_CFCR_TCF
            DMA_CFCR_TCF,
            DMA_CFCR_TCF,
            DMA_CFCR_TCF,
            DMA_CFCR_TCF,
            DMA_CFCR_TCF,
            DMA_CFCR_TCF,
            DMA_CFCR_TCF,
            DMA_CFCR_TCF,
#else
            DMA_FLAG_TC1,
            DMA_FLAG_TC2,
            DMA_FLAG_TC3,
            DMA_FLAG_TC4,
            DMA_FLAG_TC5,
            DMA_FLAG_TC6,
#if defined(DMA_FLAG_TC7)
            DMA_FLAG_TC7,
#endif
#if defined(DMA_FLAG_TC8)
            DMA_FLAG_TC8,
#endif
#endif
        };
        const std::array streamToHTIF
        {
#ifdef DMA_CFCR_HTF
            DMA_CFCR_HTF,
            DMA_CFCR_HTF,
            DMA_CFCR_HTF,
            DMA_CFCR_HTF,
            DMA_CFCR_HTF,
            DMA_CFCR_HTF,
            DMA_CFCR_HTF,
            DMA_CFCR_HTF,
#else
            DMA_FLAG_HT1,
            DMA_FLAG_HT2,
            DMA_FLAG_HT3,
            DMA_FLAG_HT4,
            DMA_FLAG_HT5,
            DMA_FLAG_HT6,
#if defined(DMA_FLAG_HT7)
            DMA_FLAG_HT7,
#endif
#if defined(DMA_FLAG_HT8)
            DMA_FLAG_HT8,
#endif
#endif
        };
        const std::array streamToTEIF
        {
#ifdef DMA_CFCR_DTEF
            DMA_CFCR_DTEF,
            DMA_CFCR_DTEF,
            DMA_CFCR_DTEF,
            DMA_CFCR_DTEF,
            DMA_CFCR_DTEF,
            DMA_CFCR_DTEF,
            DMA_CFCR_DTEF,
            DMA_CFCR_DTEF,
#else
            DMA_FLAG_TE1,
            DMA_FLAG_TE2,
            DMA_FLAG_TE3,
            DMA_FLAG_TE4,
            DMA_FLAG_TE5,
            DMA_FLAG_TE6,
#if defined(DMA_FLAG_TE7)
            DMA_FLAG_TE7,
#endif
#if defined(DMA_FLAG_TE8)
            DMA_FLAG_TE8,
#endif
#endif
        };
#endif

        // clang-format on
        static_assert(dmaISR[0].size() == dmaIFCR[0].size());
        static_assert(dmaISR[0].size() == DmaChannel[0].size());
        static_assert(dmaISR[0].size() == dmaIrq[0].size());
        static_assert(dmaISR[0].size() == streamToTCIF.size());
        static_assert(dmaISR[0].size() == streamToHTIF.size());
        static_assert(dmaISR[0].size() == streamToTEIF.size());

        uint32_t dummy;
    }

    DmaStm::DmaStm()
    {
#if defined(GPDMA1)
        __HAL_RCC_GPDMA1_CLK_ENABLE();
#if defined(GPDMA2)
        __HAL_RCC_GPDMA2_CLK_ENABLE();
#endif
#else
        __DMA1_CLK_ENABLE();
        __DMA2_CLK_ENABLE();
#if defined(__HAL_RCC_DMAMUX1_CLK_ENABLE)
        __HAL_RCC_DMAMUX1_CLK_ENABLE();
#endif
#endif
    }

    DmaStm::~DmaStm()
    {
#if defined(GPDMA1)
        __HAL_RCC_GPDMA1_CLK_DISABLE();
#if defined(GPDMA2)
        __HAL_RCC_GPDMA2_CLK_DISABLE();
#endif
#else
        __DMA1_CLK_DISABLE();
        __DMA2_CLK_DISABLE();
#if defined(__HAL_RCC_DMAMUX1_CLK_DISABLE)
        __HAL_RCC_DMAMUX1_CLK_DISABLE();
#endif
#endif
    }

    void DmaStm::ReserveStream(uint8_t dmaIndex, uint8_t streamIndex)
    {
        really_assert((streamAllocation[dmaIndex] & (1 << streamIndex)) == 0);
        streamAllocation[dmaIndex] |= 1 << streamIndex;
    }

    void DmaStm::ReleaseStream(uint8_t dmaIndex, uint8_t streamIndex)
    {
        streamAllocation[dmaIndex] &= ~(1 << streamIndex);
    }

    DmaStm::Stream::Stream(DmaStm& dma, DmaChannelId channelId)
        : dma(dma)
        , dmaIndex(channelId.dma)
#ifdef GPDMA1
        , dmaMux(channelId.mux)
#endif

#if defined(DMA_STREAM_BASED)
        , streamIndex(channelId.stream)
#else
        , streamIndex(channelId.channel)
#endif
    {
        dma.ReserveStream(dmaIndex, streamIndex);

        DMA_HandleTypeDef DmaChannelHandle = {};
        DmaChannelHandle.Instance = DmaChannel[dmaIndex][streamIndex];

#ifdef GPDMA1
        DmaChannelHandle.Instance->CCR |= (DMA_CCR_SUSP | DMA_CCR_RESET);
        DmaChannelHandle.Instance->CTR1 = 0;
        DmaChannelHandle.Instance->CTR2 = 0;
        DmaChannelHandle.Instance->CBR1 = 0;
        DmaChannelHandle.Instance->CSAR = 0;
        DmaChannelHandle.Instance->CDAR = 0;

        linkRegisters.CTR1 = 0;
        linkRegisters.CTR2 = dmaMux << DMA_CTR2_REQSEL_Pos;
        linkRegisters.CBR1 = 0;
        linkRegisters.CDAR = 0;
        linkRegisters.CSAR = 0;
        linkRegisters.CLLR = 0;
#else
        DmaChannelHandle.Init.Direction = DMA_MEMORY_TO_PERIPH;
        DmaChannelHandle.Init.Mode = DMA_NORMAL;

        DmaChannelHandle.Init.PeriphInc = DMA_PINC_DISABLE;
        DmaChannelHandle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
        DmaChannelHandle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
        DmaChannelHandle.Init.Priority = DMA_PRIORITY_MEDIUM;
#if defined(DMA_STREAM_BASED)
        DmaChannelHandle.Init.Channel = dmaChannel[channelId.channel];
        DmaChannelHandle.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
        DmaChannelHandle.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
        DmaChannelHandle.Init.MemBurst = DMA_MBURST_SINGLE;
        DmaChannelHandle.Init.PeriphBurst = DMA_PBURST_SINGLE;
#else
        DmaChannelHandle.Init.Request = channelId.mux;
#endif

        HAL_DMA_Init(&DmaChannelHandle);
#endif
    }

    DmaStm::Stream::~Stream()
    {
        if (streamIndex != 0xff)
            dma.ReleaseStream(dmaIndex, streamIndex);
    }

    DmaStm::Stream::Stream(Stream&& other) noexcept
        : dma(other.dma)
        , dmaIndex(other.dmaIndex)
        , streamIndex(other.streamIndex)
    {
        other.streamIndex = 0xff;
    }

