philips-software/amp-hal-st/hal_st/stm32fxxx/DmaStm.cpp
    DmaStm::Stream& DmaStm::Stream::operator=(Stream&& other)
    {
        dmaIndex = other.dmaIndex;
        streamIndex = other.streamIndex;

        other.streamIndex = 0xff;

        return *this;
    }

    uint8_t DmaStm::Stream::DataSize() const
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(GPDMA1)
        return 1 << ((linkRegisters.CTR1 & DMA_CTR1_DDW_LOG2) >> POSITION_VAL(DMA_CTR1_DDW_LOG2));
#elif defined(DMA_SxCR_MSIZE)
        return 1 << ((streamRegister->CR & DMA_SxCR_MSIZE) >> POSITION_VAL(DMA_SxCR_MSIZE));
#else
        return 1 << ((streamRegister->CCR & DMA_CCR_MSIZE) >> POSITION_VAL(DMA_CCR_MSIZE));
#endif
    }

    void DmaStm::Stream::SetDataSize(uint8_t dataSizeInBytes)
    {
        SetPeripheralDataSize(dataSizeInBytes);
        SetMemoryDataSize(dataSizeInBytes);
    }

    void DmaStm::Stream::SetPeripheralDataSize(uint8_t dataSizeInBytes)
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];

#if defined(GPDMA1)
        dataSizeInBytes &= 0x03;
        uint32_t mask{ 0 };
        if (!(linkRegisters.CTR2 & DMA_MEMORY_TO_MEMORY) && (linkRegisters.CTR2 & DMA_MEMORY_TO_PERIPH))
            mask = (dataSizeInBytes >> 1) << DMA_CTR1_DDW_LOG2_Pos;
        else if (!(linkRegisters.CTR2 & DMA_MEMORY_TO_MEMORY))
            mask = (dataSizeInBytes >> 1) << DMA_CTR1_SDW_LOG2_Pos;

        linkRegisters.CTR1 = (linkRegisters.CTR1 & ~mask) | (linkRegisters.CTR1 | mask);
#elif defined(DMA_SxCR_PSIZE)
        streamRegister->CR = (streamRegister->CR & ~DMA_SxCR_PSIZE) | ((dataSizeInBytes & 1) == 0 ? DMA_SxCR_PSIZE_0 : 0) | (dataSizeInBytes > 2 ? DMA_SxCR_PSIZE_1 : 0);
#else
        streamRegister->CCR = (streamRegister->CCR & ~DMA_CCR_PSIZE) | ((dataSizeInBytes & 1) == 0 ? DMA_CCR_PSIZE_0 : 0) | (dataSizeInBytes > 2 ? DMA_CCR_PSIZE_1 : 0);
#endif
    }

    void DmaStm::Stream::SetMemoryDataSize(uint8_t dataSizeInBytes)
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(GPDMA1)
        dataSizeInBytes &= 0x03;
        uint32_t mask{ 0 };
        if (!(linkRegisters.CTR2 & DMA_MEMORY_TO_MEMORY) && (linkRegisters.CTR2 & DMA_MEMORY_TO_PERIPH))
            mask = (dataSizeInBytes >> 1) << DMA_CTR1_SDW_LOG2_Pos;
        else if (!(linkRegisters.CTR2 & DMA_MEMORY_TO_MEMORY))
            mask = (dataSizeInBytes >> 1) << DMA_CTR1_DDW_LOG2_Pos;

        linkRegisters.CTR1 = (linkRegisters.CTR1 & ~mask) | (linkRegisters.CTR1 | mask);
#elif defined(DMA_SxCR_MSIZE)
        streamRegister->CR = (streamRegister->CR & ~DMA_SxCR_MSIZE) | ((dataSizeInBytes & 1) == 0 ? DMA_SxCR_MSIZE_0 : 0) | (dataSizeInBytes > 2 ? DMA_SxCR_MSIZE_1 : 0);
#else
        streamRegister->CCR = (streamRegister->CCR & ~DMA_CCR_MSIZE) | ((dataSizeInBytes & 1) == 0 ? DMA_CCR_MSIZE_0 : 0) | (dataSizeInBytes > 2 ? DMA_CCR_MSIZE_1 : 0);
#endif
    }

    bool DmaStm::Stream::StopTransfer()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
        bool finished = Finished();
        Disable();
        *dmaIFCR[dmaIndex][streamIndex] |= streamToTCIF[streamIndex] | streamToHTIF[streamIndex];
        return !finished;
    }

    void DmaStm::Stream::Disable()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#ifdef GPDMA1
        streamRegister->CCR |= (DMA_CCR_SUSP | DMA_CCR_RESET);
#endif
#if defined(DMA_CCR_EN)
        streamRegister->CCR &= ~DMA_CCR_EN;
#else
        streamRegister->CR &= ~DMA_SxCR_EN;
#endif
    }

    void DmaStm::Stream::DisableHalfTransferCompleteInterrupt()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(DMA_SxCR_HTIE)
        streamRegister->CR &= ~DMA_IT_HT;
#else
        streamRegister->CCR &= ~DMA_IT_HT;
#endif
    }

    void DmaStm::Stream::DisableMemoryIncrement()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(GPDMA1)
        linkRegisters.CTR1 &= (!(linkRegisters.CTR2 & DMA_CTR2_SWREQ) && (linkRegisters.CTR2 & DMA_CTR2_DREQ)) ? ~DMA_CTR1_SINC : ~DMA_CTR1_DINC;
#elif defined(DMA_SxCR_MINC)
        streamRegister->CR &= ~DMA_MINC_ENABLE;
#else
        streamRegister->CCR &= ~DMA_MINC_ENABLE;
#endif
    }

    void DmaStm::Stream::DisableTransferCompleteInterrupt()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(DMA_SxCR_TCIE)
        streamRegister->CR &= ~DMA_IT_TC;
#else
        streamRegister->CCR &= ~DMA_IT_TC;
#endif
    }

    void DmaStm::Stream::DisableCircularMode()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(GPDMA1)
        linkRegisters.CLLR = 0;
#elif defined(DMA_SxCR_CIRC)
        streamRegister->CR &= ~DMA_SxCR_CIRC;
#else
        streamRegister->CCR &= ~DMA_CCR_CIRC;
#endif
    }

    void DmaStm::Stream::Enable()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(GPDMA1)
        streamRegister->CCR |= DMA_CCR_PRIO | DMA_LOW_PRIORITY_HIGH_WEIGHT | DMA_LSM_FULL_EXECUTION;
        streamRegister->CLLR = (reinterpret_cast<uint32_t>(&linkRegisters) & DMA_CLLR_LA) | DMA_CLLR_UT1 | DMA_CLLR_UT2 | DMA_CLLR_UB1 | DMA_CLLR_USA | DMA_CLLR_UDA | DMA_CLLR_ULL;
        streamRegister->CLBAR = (reinterpret_cast<uint32_t>(&linkRegisters) & DMA_CLBAR_LBA);
#endif
#if defined(DMA_CCR_EN)
        streamRegister->CCR |= DMA_CCR_EN;
#else
        streamRegister->CR |= DMA_SxCR_EN;
#endif
    }

    void DmaStm::Stream::EnableHalfTransferCompleteInterrupt()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(DMA_SxCR_HTIE)
        streamRegister->CR |= DMA_IT_HT;
#else
        streamRegister->CCR |= DMA_IT_HT;
#endif
    }

    void DmaStm::Stream::EnableMemoryIncrement()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(GPDMA1)
        linkRegisters.CTR1 |= (!(linkRegisters.CTR2 & DMA_MEMORY_TO_MEMORY) && (linkRegisters.CTR2 & DMA_MEMORY_TO_PERIPH)) ? DMA_CTR1_SINC : DMA_CTR1_DINC;
#elif defined(DMA_SxCR_MINC)
        streamRegister->CR |= DMA_MINC_ENABLE;
#else
        streamRegister->CCR |= DMA_MINC_ENABLE;
#endif
    }

    void DmaStm::Stream::EnableTransferCompleteInterrupt()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(DMA_SxCR_TCIE)
        streamRegister->CR |= DMA_IT_TC;
#else
        streamRegister->CCR |= DMA_IT_TC;
#endif
    }

    void DmaStm::Stream::EnableCircularMode()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(GPDMA1)
        linkRegisters.CLLR = DMA_CLLR_UT1 | DMA_CLLR_UT2 | DMA_CLLR_UB1 | DMA_CLLR_USA | DMA_CLLR_UDA | DMA_CLLR_ULL | (reinterpret_cast<uint32_t>(&linkRegisters) & DMA_CLLR_LA);
#elif defined(DMA_SxCR_CIRC)
        streamRegister->CR |= DMA_SxCR_CIRC;
#else
        streamRegister->CCR |= DMA_CCR_CIRC;
#endif
    }

