philips-software/amp-hal-st/hal_st/stm32fxxx/DmaStm.cpp
    void DmaStm::CircularStreamInterruptHandler::OnInterrupt()
    {
        if (stream.IsHalfComplete())
        {
            stream.ClearHalfComplete();

            immediateInterruptHandler.ClearPending();

            transferHalfComplete();
        }

        if (stream.IsFullComplete())
        {
            stream.ClearFullComplete();

            immediateInterruptHandler.ClearPending();

            transferFullComplete();
        }
    }

    DmaStm::PeripheralTransceiveStream::PeripheralTransceiveStream(TransceiveStream& stream, [[maybe_unused]]volatile void* peripheralAddress, [[maybe_unused]]uint8_t peripheralTransferSize)
        : stream{ stream }
    {
#ifndef GPDMA1
        stream.SetPeripheralAddress(peripheralAddress);
        stream.SetPeripheralDataSize(peripheralTransferSize);
#endif
    }

#ifdef GPDMA1
    void DmaStm::PeripheralTransceiveStream::SetMemoryToPeripheralMode()
    {
        stream.SetMemoryToPeripheralMode();
    }

    void DmaStm::PeripheralTransceiveStream::SetPeripheralToMemoryMode()
    {
        stream.SetPeripheralToMemoryMode();
    }

    void DmaStm::PeripheralTransceiveStream::SetPeripheralAddress(volatile void* peripheralAddress)
    {
        stream.SetPeripheralAddress(peripheralAddress);
    }
#endif

    void DmaStm::PeripheralTransceiveStream::SetPeripheralTransferSize(uint8_t peripheralTransferSize)
    {
        stream.SetPeripheralDataSize(peripheralTransferSize);
    }

    bool DmaStm::PeripheralTransceiveStream::StopTransfer()
    {
        return stream.StopTransfer();
    }

    void DmaStm::PeripheralTransceiveStream::StartTransmitDummy(uint16_t size, uint8_t dataSize)
    {
        stream.SetMemoryDataSize(dataSize);
        stream.StartTransmitDummy(size);
    }

    void DmaStm::PeripheralTransceiveStream::StartReceiveDummy(uint16_t size, uint8_t dataSize)
    {
        stream.SetMemoryDataSize(dataSize);
        stream.StartReceiveDummy(size);
    }

    size_t DmaStm::PeripheralTransceiveStream::ReceivedSize() const
    {
        return stream.ReceivedSize();
    }

    ///////////////////////////////

    TransceiverDmaChannelBase::TransceiverDmaChannelBase(DmaStm::TransceiveStream& stream, volatile void* peripheralAddress, uint8_t peripheralTransferSize)
        : peripheralStream{ stream, peripheralAddress, peripheralTransferSize }
    {
    }

#ifdef GPDMA1
    void TransceiverDmaChannelBase::SetMemoryToPeripheralMode()
    {
        peripheralStream.SetMemoryToPeripheralMode();
    }

    void TransceiverDmaChannelBase::SetPeripheralToMemoryMode()
    {
        peripheralStream.SetPeripheralToMemoryMode();
    }

    void TransceiverDmaChannelBase::SetPeripheralAddress(volatile void* peripheralAddress)
    {
        peripheralStream.SetPeripheralAddress(peripheralAddress);
    }
#endif

    bool TransceiverDmaChannelBase::StopTransfer()
    {
        return peripheralStream.StopTransfer();
    }

    void TransceiverDmaChannelBase::SetPeripheralTransferSize(uint8_t peripheralTransferSize)
    {
        peripheralStream.SetPeripheralTransferSize(peripheralTransferSize);
    }

    void TransceiverDmaChannelBase::StartTransmitDummy(uint16_t size, uint8_t dataSize)
    {
        peripheralStream.StartTransmitDummy(size, dataSize);
    }

    size_t TransceiverDmaChannelBase::ReceivedSize() const
    {
        return peripheralStream.ReceivedSize();
    }

    void TransceiverDmaChannelBase::StartReceiveDummy(uint16_t size, uint8_t dataSize)
    {
        peripheralStream.StartReceiveDummy(size, dataSize);
    }

    TransceiverDmaChannel::TransceiverDmaChannel(DmaStm::TransceiveStream& stream, volatile void* peripheralAddress, uint8_t peripheralTransferSize, const infra::Function<void()>& transferFullComplete, const DmaStm::StreamInterruptHandler::Dispatched& irqHandlerType)
        : TransceiverDmaChannelBase{ stream, peripheralAddress, peripheralTransferSize }
        , streamInterruptHandler{ stream, transferFullComplete, irqHandlerType }
    {}

    TransceiverDmaChannel::TransceiverDmaChannel(DmaStm::TransceiveStream& stream, volatile void* peripheralAddress, uint8_t peripheralTransferSize, const infra::Function<void()>& transferFullComplete, const DmaStm::StreamInterruptHandler::Immediate& irqHandlerType)
        : TransceiverDmaChannelBase{ stream, peripheralAddress, peripheralTransferSize }
        , streamInterruptHandler{ stream, transferFullComplete, irqHandlerType }
    {}

    TransmitDmaChannel::TransmitDmaChannel(DmaStm::TransmitStream& stream, volatile void* peripheralAddress, uint8_t peripheralTransferSize, const infra::Function<void()>& transferFullComplete, const DmaStm::StreamInterruptHandler::Dispatched& irqHandlerType)
        : TransceiverDmaChannel{ stream, peripheralAddress, peripheralTransferSize, transferFullComplete, irqHandlerType }
    {
#ifdef GPDMA1
        SetMemoryToPeripheralMode();
        SetPeripheralAddress(peripheralAddress);
#endif
    }

    TransmitDmaChannel::TransmitDmaChannel(DmaStm::TransmitStream& stream, volatile void* peripheralAddress, uint8_t peripheralTransferSize, const infra::Function<void()>& transferFullComplete, const DmaStm::StreamInterruptHandler::Immediate& irqHandlerType)
        : TransceiverDmaChannel{ stream, peripheralAddress, peripheralTransferSize, transferFullComplete, irqHandlerType }
    {
#ifdef GPDMA1
        SetMemoryToPeripheralMode();
        SetPeripheralAddress(peripheralAddress);
#endif
    }

    ReceiveDmaChannel::ReceiveDmaChannel(DmaStm::ReceiveStream& stream, volatile void* peripheralAddress, uint8_t peripheralTransferSize, const infra::Function<void()>& transferFullComplete, const DmaStm::StreamInterruptHandler::Dispatched& irqHandlerType)
        : TransceiverDmaChannel{ stream, peripheralAddress, peripheralTransferSize, transferFullComplete, irqHandlerType }
    {
#ifdef GPDMA1
        SetPeripheralToMemoryMode();
        SetPeripheralAddress(peripheralAddress);
#endif
    }

    ReceiveDmaChannel::ReceiveDmaChannel(DmaStm::ReceiveStream& stream, volatile void* peripheralAddress, uint8_t peripheralTransferSize, const infra::Function<void()>& transferFullComplete, const DmaStm::StreamInterruptHandler::Immediate& irqHandlerType)
        : TransceiverDmaChannel{ stream, peripheralAddress, peripheralTransferSize, transferFullComplete, irqHandlerType }
    {
#ifdef GPDMA1
        SetPeripheralToMemoryMode();
        SetPeripheralAddress(peripheralAddress);
#endif
    }

