philips-software/amp-hal-st/hal_st/stm32fxxx/DmaStm.cpp
    CircularTransceiverDmaChannel::CircularTransceiverDmaChannel(DmaStm::TransceiveStream& stream, volatile void* peripheralAddress, uint8_t peripheralTransferSize, const infra::Function<void()>& transferHalfComplete, const infra::Function<void()>& transferFullComplete)
        : TransceiverDmaChannelBase{ stream, peripheralAddress, peripheralTransferSize }
        , circularStreamInterruptHandler{ stream, transferHalfComplete, transferFullComplete }
    {}

    bool CircularTransceiverDmaChannel::IsInterruptPending() const
    {
        return circularStreamInterruptHandler.IsInterruptPending();
    }

    CircularTransmitDmaChannel::CircularTransmitDmaChannel(DmaStm::TransmitStream& stream, volatile void* peripheralAddress, uint8_t peripheralTransferSize, const infra::Function<void()>& transferHalfComplete, const infra::Function<void()>& transferFullComplete)
        : CircularTransceiverDmaChannel{ stream, peripheralAddress, peripheralTransferSize, transferHalfComplete, transferFullComplete }
    {
#ifdef GPDMA1
        SetMemoryToPeripheralMode();
        SetPeripheralAddress(peripheralAddress);
#endif
}

    CircularReceiveDmaChannel::CircularReceiveDmaChannel(DmaStm::ReceiveStream& stream, volatile void* peripheralAddress, uint8_t peripheralTransferSize, const infra::Function<void()>& transferHalfComplete, const infra::Function<void()>& transferFullComplete)
        : CircularTransceiverDmaChannel{ stream, peripheralAddress, peripheralTransferSize, transferHalfComplete, transferFullComplete }
    {
#ifdef GPDMA1
        SetPeripheralToMemoryMode();
        SetPeripheralAddress(peripheralAddress);
#endif
    }
}

#endif
